public class Main {
    public static void main(String[] args) {

        int ticketPrice = 25_670;
        int bonusMile = 20;
        int bonus = ticketPrice / bonusMile;

        System.out.println("Бонусных миль при покупке билета: " + bonus);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}